Catalogs/Преподаватели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Преподаватели</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизЛица</xr:Item>
				<xr:Item>Catalog.Предметы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Преподаватели/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизЛица") И НЕ ДанныеЗаполнения.ЭтоГруппа Тогда
		Наименование= ДанныеЗаполнения.Наименование;
		ФизЛицо		= ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Предметы") Тогда
		Если ДанныеЗаполнения.ЭтоГруппа Тогда
			Выборка = Справочники.Предметы.Выбрать(ДанныеЗаполнения, ,);
			Пока Выборка.Следующий() Цикл
				Заполнить(Выборка.Ссылка);
			КонецЦикла;
		Иначе
			ТекСтрока = Предметы.Добавить();
			ТекСтрока.Предмет	= ДанныеЗаполнения;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если НЕ ЗначениеЗаполнено(Предмет) И Предметы.Количество() > 0 Тогда
		Предмет = Предметы[0].Предмет;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ФизЛицо	= Неопределено;
КонецПроцедуры
